# Data Cleaning 

#### 1. Import pandas library.

In [1]:
import pandas as pd

#### 2. Import pymysql and sqlalchemy as you have learnt in the lesson of importing/exporting data.

#### 3. Create a mysql engine to set the connection to the server. Check the connection details in [this link](https://relational.fit.cvut.cz/dataset/Stats).

#### 4. Import the users table.

In [4]:
users=pd.read_csv("../datasets/users.csv")

In [5]:
users.head()

   Unnamed: 0  userId  Reputation  Views  UpVotes  DownVotes
0           0      -1           1      0     5007       1920
1           1       2         101     25        3          0
2           2       3         101     22       19          0
3           3       4         101     11        0          0
4           4       5        6792   1145      662          5

#### 5. Rename Id column to userId.

In [9]:
users.rename({"Id":"userId"},inplace=True)

#### 6. Import the posts table.

In [39]:
posts=pd.read_csv("../datasets/posts.csv")

In [40]:
posts.head()

   Unnamed: 0  PostId  userId  Score  ViewCount  CommentCount
0           0       1     8.0     23     1278.0             1
1           1       2    24.0     22     8198.0             1
2           2       3    18.0     54     3613.0             4
3           3       4    23.0     13     5224.0             2
4           4       5    23.0     81        NaN             3

In [ ]:
posts = posts.drop('Unnamed: 0', axis = 1)

In [ ]:
posts = posts[["postId", "Score", "userId", "ViewCount", "CommentCount"]]

#### 7. Rename Id column to postId and OwnerUserId to userId.

In [8]:
#It is already done otherwise see preview above

#### 8. Define new dataframes for users and posts with the following selected columns:
**users_sliced columns**: userId, Reputation, Views, UpVotes, DownVotes  
**posts_sliced columns**: postId, Score, userId, ViewCount, CommentCount

In [74]:
usersc=["userId", "Reputation", "Views", "UpVotes", "DownVotes"]
postsc=["PostId", "Score", "userId", "ViewCount", "CommentCount"]

In [75]:
#change all the column names for the ones specified in usersc and postsc

users_sliced=pd.DataFrame(users,columns=usersc)
posts_sliced=pd.DataFrame(posts,columns=postsc)

In [76]:
#let's check if the names are changed

print("users:",users_sliced.columns.values.tolist())
print("posts:",posts_sliced.columns.values.tolist())

users: ['userId', 'Reputation', 'Views', 'UpVotes', 'DownVotes']
posts: ['PostId', 'Score', 'userId', 'ViewCount', 'CommentCount']

In [77]:
users_sliced.head()

   userId  Reputation  Views  UpVotes  DownVotes
0      -1           1      0     5007       1920
1       2         101     25        3          0
2       3         101     22       19          0
3       4         101     11        0          0
4       5        6792   1145      662          5

In [78]:
posts_sliced.head()
#print(posts.head())

   PostId  Score  userId  ViewCount  CommentCount
0       1     23     8.0     1278.0             1
1       2     22    24.0     8198.0             1
2       3     54    18.0     3613.0             4
3       4     13    23.0     5224.0             2
4       5     81    23.0        NaN             3

In [72]:
posts_sliced["postId"].value_counts()

Series([], Name: postId, dtype: int64)

#### 9. Merge the two dataframes created in the step above (8), users_sliced and posts_sliced. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [85]:
Merge=users_sliced.merge(right=posts_sliced,on="userId" )
Merge.head(5)

,userId,Reputation,Views,UpVotes,DownVotes,PostId,Score,ViewCount,CommentCount
0,-1,1,0,5007,1920,2175,0,NaN,0
1,-1,1,0,5007,1920,8576,0,NaN,0
2,-1,1,0,5007,1920,8578,0,NaN,0
3,-1,1,0,5007,1920,8981,0,NaN,0
4,-1,1,0,5007,1920,8982,0,NaN,0

In [87]:
Merge["ViewCount"].value_counts()
#making sure it is not empty and the merge was successful

38.0       295
31.0       293
37.0       277
27.0       277
24.0       274
          ...
25962.0      1
2586.0       1
2067.0       1
4443.0       1
3940.0       1
Name: ViewCount, Length: 3654, dtype: int64

#### 10. How many missing values do you have in your merged dataframe? On which columns?

In [96]:
Merge.isnull().sum()
#there are 483896 missing values in ViewCount

userId              0
Reputation          0
Views               0
UpVotes             0
DownVotes           0
PostId              0
Score               0
ViewCount       48396
CommentCount        0
dtype: int64

#### 11. You will need to make something with missing values.  Will you clean or filling them? Explain. 
**Remember** to check the results of your code before going to the next step.

#### 12. Adjust the data types in order to avoid future issues. Which ones should be changed?

In [100]:
Merge.dtypes

userId            int64
Reputation        int64
Views             int64
UpVotes           int64
DownVotes         int64
PostId            int64
Score             int64
ViewCount       float64
CommentCount      int64
dtype: object